<h1> Pandas - DataFrames </h1>

In [1]:
import pandas as pd
import numpy as np
import string

<h1> Operações com DataFrames

In [2]:
dict = {'Coluna1': [190, 231, 784, 127],
       'Coluna2': [545, 278, 104, 347],
       'Coluna3': [665, 224, 901, 503],
       'Coluna4': [123, 456, 789, 763]}

In [3]:
df = pd.DataFrame(dict)

In [4]:
df

   Coluna1  Coluna2  Coluna3  Coluna4
0      190      545      665      123
1      231      278      224      456
2      784      104      901      789
3      127      347      503      763

In [5]:
df.dtypes

Coluna1    int64
Coluna2    int64
Coluna3    int64
Coluna4    int64
dtype: object

In [6]:
df['Coluna2']

0    545
1    278
2    104
3    347
Name: Coluna2, dtype: int64

In [7]:
df['Coluna2'][0]

545

In [10]:
df[:2]

   Coluna1  Coluna2  Coluna3  Coluna4
0      190      545      665      123
1      231      278      224      456

In [11]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [12]:
df.insert(0, 'ID', [1,2,3,4])

In [14]:
df

   ID  Coluna1  Coluna2  Coluna3  Coluna4
0   1      190      545      665      123
1   2      231      278      224      456
2   3      784      104      901      789
3   4      127      347      503      763

In [15]:
df2 = pd.DataFrame(df.set_index('ID'))

In [16]:
df2

    Coluna1  Coluna2  Coluna3  Coluna4
ID
1       190      545      665      123
2       231      278      224      456
3       784      104      901      789
4       127      347      503      763

<h1> Mais DataFrames

In [17]:
colunas = list(range(26))

In [19]:
ucase = [x for x in string.ascii_uppercase]
lcase = [x for x in string.ascii_lowercase]

In [20]:
alfabeto = pd.DataFrame([lcase, ucase, colunas])

In [21]:
alfabeto

  0  1  2  3  4  5  6  7  8  9   ...  16  17  18  19  20  21  22  23  24  25
0  a  b  c  d  e  f  g  h  i  j  ...   q   r   s   t   u   v   w   x   y   z
1  A  B  C  D  E  F  G  H  I  J  ...   Q   R   S   T   U   V   W   X   Y   Z
2  0  1  2  3  4  5  6  7  8  9  ...  16  17  18  19  20  21  22  23  24  25

[3 rows x 26 columns]

In [29]:
# Tranposta da Matriz (DataFrame)
alfabeto = alfabeto.T
alfabeto

    0  1   2
0   a  A   0
1   b  B   1
2   c  C   2
3   d  D   3
4   e  E   4
5   f  F   5
6   g  G   6
7   h  H   7
8   i  I   8
9   j  J   9
10  k  K  10
11  l  L  11
12  m  M  12
13  n  N  13
14  o  O  14
15  p  P  15
16  q  Q  16
17  r  R  17
18  s  S  18
19  t  T  19
20  u  U  20
21  v  V  21
22  w  W  22
23  x  X  23
24  y  Y  24
25  z  Z  25

In [30]:
alfabeto.head()

   0  1  2
0  a  A  0
1  b  B  1
2  c  C  2
3  d  D  3
4  e  E  4

In [31]:
alfabeto.index

RangeIndex(start=0, stop=26, step=1)

In [32]:
alfabeto.columns

RangeIndex(start=0, stop=3, step=1)

In [33]:
alfabeto.columns = ['minusculo', 'maiusculo', 'numero']

In [34]:
alfabeto['minusculo']

0     a
1     b
2     c
3     d
4     e
5     f
6     g
7     h
8     i
9     j
10    k
11    l
12    m
13    n
14    o
15    p
16    q
17    r
18    s
19    t
20    u
21    v
22    w
23    x
24    y
25    z
Name: minusculo, dtype: object